In [3]:
#!pip install pymysql ipython-sql sqlalchemy

In [5]:
%load_ext sql

In [25]:
%sql mysql+pymysql://root:DemoEldohub@localhost:3306/md_water_services

In [7]:
%%sql
SHOW TABLES;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
8 rows affected.

[('data_dictionary',),
 ('employee',),
 ('global_water_access',),
 ('location',),
 ('visits',),
 ('water_quality',),
 ('water_source',),
 ('well_pollution',)]

In [9]:
%%sql
SELECT *
FROM employee
LIMIT 3;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(0, 'Amara Jengo', '+99637993287 ', None, '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786 ', None, '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041 ', None, '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor')]

In [10]:
%%sql
SELECT *
FROM global_water_access
LIMIT 3;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[('Afghanistan', 'South Asia', 2015, 34413.6, 24.803, 61.3398, 3.5112, 22.1688, 12.9802, 52.9885, 3.86114, 26.5533, 16.5971, 86.6589, 2.45027, 8.87604, 2.01475),
 ('Afghanistan', 'South Asia', 2020, 38928.3, 26.026, 75.0914, 1.44754, 14.5603, 8.90078, 66.3279, 1.95682, 19.6829, 12.0323, 100.0, 0.0, 0.0, 0.0),
 ('Albania', 'Europe & Central Asia', 2015, 2890.52, 57.434, 93.3943, 3.62638, 2.97929, 0.0, 90.6273, 5.26317, 4.10955, 0.0, 95.4451, 2.41331, 2.14162, 0.0)]

In [11]:
%%sql
SELECT *
FROM location
LIMIT 3;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[('AkHa00000', '2 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00001', '10 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00002', '9 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban')]

In [12]:
%%sql
SELECT *
FROM visits
LIMIT 3;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(0, 'SoIl32582', 'SoIl32582224', datetime.datetime(2021, 1, 1, 9, 10), 1, 15, 12),
 (1, 'KiRu28935', 'KiRu28935224', datetime.datetime(2021, 1, 1, 9, 17), 1, 0, 46),
 (2, 'HaRu19752', 'HaRu19752224', datetime.datetime(2021, 1, 1, 9, 36), 1, 62, 40)]

In [13]:
%%sql
SELECT *
FROM water_quality
LIMIT 3;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(0, 0, 1), (1, 1, 1), (2, 5, 1)]

In [14]:
%%sql
SELECT *
FROM water_source
LIMIT 3;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[('AkHa00000224', 'tap_in_home', 956),
 ('AkHa00001224', 'tap_in_home_broken', 930),
 ('AkHa00002224', 'tap_in_home_broken', 486)]

In [15]:
%%sql
SELECT *
FROM well_pollution
LIMIT 3;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[('KiRu28935224', datetime.datetime(2021, 1, 4, 9, 17), 'Bacteria: Giardia Lamblia', 0.0, 495.898, 'Contaminated: Biological'),
 ('AkLu01628224', datetime.datetime(2021, 1, 4, 9, 53), 'Bacteria: E. coli', 0.0, 6.09608, 'Contaminated: Biological'),
 ('HaZa21742224', datetime.datetime(2021, 1, 4, 10, 37), 'Inorganic contaminants: Zinc, Zinc, Lead, Cadmium', 2.715, 0.0, 'Contaminated: Chemical')]

In [16]:
%%sql
SELECT *
FROM employee
LIMIT 3;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(0, 'Amara Jengo', '+99637993287 ', None, '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786 ', None, '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041 ', None, '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor')]

Ok, bring up the employee table. It has info on all of our workers, but note that the email addresses have not been added. We will have to send
them reports and figures, so let's update it. Luckily the emails for our department are easy: first_name.last_name@ndogowater.gov.

In [17]:
%%sql
SELECT REPLACE(employee_name, ' ', '.' ) AS formatted_name 
FROM employee

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[('Amara.Jengo',),
 ('Bello.Azibo',),
 ('Bakari.Iniko',),
 ('Malachi.Mavuso',),
 ('Cheche.Buhle',),
 ('Zuriel.Matembo',),
 ('Deka.Osumare',),
 ('Lalitha.Kaburi',),
 ('Enitan.Zuri',),
 ('Farai.Nia',),
 ('Gamba.Shani',),
 ('Harith.Nyota',),
 ('Isoke.Amani',),
 ('Jengo.Tumaini',),
 ('Kunto.Asha',),
 ('Lesedi.Kofi',),
 ('Makena.Thabo',),
 ('Nia.Furaha',),
 ('Ona.Sefu',),
 ('Pili.Zola',),
 ('Quibilah.Akua',),
 ('Rudo.Imani',),
 ('Sanaa.Tendaji',),
 ('Thandiwe.Kito',),
 ('Usafi.Ayo',),
 ('Vuyisile.Kwame',),
 ('Wambui.Jabali',),
 ('Xola.Uzuri',),
 ('Yewande.Ebele',),
 ('Nadia.Zalika',),
 ('Ayo.Deka',),
 ('Bahira.Jamila',),
 ('Chidi.Kunto',),
 ('Dalila.Lesedi',),
 ('Eshe.Makena',),
 ('Faridah.Khalida',),
 ('Gavivi.Ona',),
 ('Hasani.Pili',),
 ('Iniko.Quibilah',),
 ('Jengo.Rudo',),
 ('Kofi.Sanaa',),
 ('Lulu.Thandiwe',),
 ('Makena.Usafi',),
 ('Nia.Vuyisile',),
 ('Ona.Wambui',),
 ('Pili.Xola',),
 ('Quibilah.Yewande',),
 ('Rudo.Zalika',),
 ('Sanaa.Ayo',),
 ('Thabo.Akida',),
 ('Usafi.Bahir',),
 ('Vuyisile.Ghadir',),
 ('Wambui.Hadiya',),
 ('Xola.Inaya',),
 ('Yewande.Jengo',),
 ('Zuri.Kofi',)]

In [19]:
%%sql
SELECT LOWER(REPLACE(employee_name, ' ', '.' )) AS formatted_name 
FROM employee

LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('amara.jengo',),
 ('bello.azibo',),
 ('bakari.iniko',),
 ('malachi.mavuso',),
 ('cheche.buhle',)]

Ok, bring up the employee table. It has info on all of our workers, but note that the email addresses have not been added. We will have to send
them reports and figures, so let's update it. Luckily the emails for our department are easy: first_name.last_name@ndogowater.gov.

In [20]:
%%sql
SELECT CONCAT(LOWER(REPLACE(employee_name, ' ', '.' )), '@ndogowater.gov') AS formatted_name 
FROM employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('amara.jengo@ndogowater.gov',),
 ('bello.azibo@ndogowater.gov',),
 ('bakari.iniko@ndogowater.gov',),
 ('malachi.mavuso@ndogowater.gov',),
 ('cheche.buhle@ndogowater.gov',)]

In [22]:
%%sql
UPDATE  employee
SET email = CONCAT(LOWER(REPLACE(employee_name, ' ', '.' )), '@ndogowater.gov')

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

In [23]:
%%sql
SELECT *
FROM employee 
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(0, 'Amara Jengo', '+99637993287 ', 'amara.jengo@ndogowater.gov', '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786 ', 'bello.azibo@ndogowater.gov', '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041 ', 'bakari.iniko@ndogowater.gov', '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900 ', 'malachi.mavuso@ndogowater.gov', '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640 ', 'cheche.buhle@ndogowater.gov', '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor')]